[
 {
   "Name": "Word Clouds",
   "Number": 125,
   "Grade": 4,
   "Input": "Text-based document, for example containing interview transcripts or survey results.",
   "Output": "Visual summary of the text.",
   "What it does": "The most common words in a text document are collected and represented in a colorful word collage.",
   "How it works": "The method of creating word clouds is about collecting the set of the most frequently used words in a text document in order to visualize what the document is about. The frequency is usually represented by making the font size of the words larger according to how often they appear in the text. This can in particular be useful when summarizing survey or interview data by using the transcripts as the source document when generating the word cloud. The method gives readers an overview of the findings it represents and is relatively easy to understand no matter the technical knowledge of the reader (Hanington & Martin, 2019, pp. 256-257).\n        In order to create useful word clouds, it is important to do so carefully. They should reveal essential information, be engaging and give a good overall sense of the text. The reader must also be aware that size is not everything, for example a long word might trick the mind and appear bigger than a short word even though they are the same font size. It can be useful to filter out unimportant words such as ‘and’, ‘the’, ‘a’, etc. since such joiner words only produce noise in the data (Alida, 2012).\n",
   "Experience": "I have not used this as a design method a lot although I am very familiar with it. My experience is however that it is usually easy to understand them no matter if you’re an elementary student or a college professor. Sometimes they are used “incorrectly” by repeating some words to make the cloud look bigger, but in turn the frequency is no longer represented by the font size. Often this is done when the word cloud is made for decorative rather than informative purposes. They become more difficult to understand once there are a lot of words in the cloud. As long as some thought is put into their design, e.g. in terms of removing uninformative words and paying attention to the amount of words, I think word clouds can be a helpful way of giving an overview of research findings.",
   "References": "Alida. (2012, August 9). The Pros and Cons of Word Clouds as Visualizations. https://www.alida.com/the-alida-journal/pros-and-cons-word-clouds-visualizations\nHanington, B., & Martin, B. (2019). Universal methods of design expanded and revised. Quarto Publishing Group USA.",
   "Tags": "illustrations;visualizing;text-based"
 },
 {
   "Name": "The Love and the Breakup Letter",
   "Number": 72,
   "Grade": 8,
   "Input": "Users write down their own thoughts and feelings regarding a product.",
   "Output": "Users’ feelings, thoughts, memories and attitude towards a product.",
   "What it does": "Workshop participants write their own love or breakup letters and then share their letters with the other participants and researchers/facilitators.",
   "How it works": "The method of writing love and breakup letters aid participants of e.g. design workshops, group interviews or icebreaker sessions in communicating any positive or negative feelings towards a product. The method can traditionally be applied during phases one, two or five. In the beginning, the participants are asked to write either a love or a breakup letter, or both, towards a sometimes predefined product. The output are letters that provide surprisingly good insights into the mindspace of the participants and users of the products. Participants tend to get very personal and dramatic when writing their letters, leading those letters to provide great insight into what people like or dislike about a product. While the Love Letter explores the origins of positive feelings such as delight and loyalty, the Breakup Letter explores the reasons why a user has experienced a negative relationship with the product. Both types of letters help the researchers better understand the dynamics of the user-product relationship (Hanington & Martin, 2019, p. 150).\nHaving participants read their letters aloud to the group helps facilitate discussions and provides the opportunity to ask other participants if they agree or have experienced similar feelings in order to measure how common those feelings are. Laughley et al. recommend that all participants finish reading their letters aloud before the group engages in discussion, so that no one feels discouraged in sharing their feelings if someone else has already expressed similar thoughts and received negative feedback (Laughey et al., 2021).\nParticipants are usually not given a very long time to write their letters. Some recommend as little as ten minutes so that participants don’t overthink the assignment (Crawford, 2021).\n",
   "Experience": "My experience with this method is that it is a really fun method for participants who are given total freedom to express any feelings they might have towards the product they are writing about. It can be time consuming if the person wants to make the letter perfect, so therefore it is important to set a time limit to the writing activities. In my opinion ten to thirty minutes would suffice, depending on how much details the researchers want to receive. \nSome drawbacks of the method that I see are that the participants might get overly dramatic and make their problems or likes sound more important than they really are, and that some people might not feel comfortable sharing their letters with the whole group. However the method is still a great way to quickly point out the pros and cons of a product with real users.\n",
   "References": "Crawford, K. (2021, January 19). Design Thinking Toolkit, Activity 1 – The Love/Breakup Letter. Atomic Spin. https://spin.atomicobject.com/2017/06/29/design-thinking-activity-love-breakup-letter/\nHanington, B., & Martin, B. (2019). Universal methods of design expanded and revised. Quarto Publishing Group USA.\nLaughey, W. F., Brown, M. E. L., Liu, A., Dueñas, A. N., & Finn, G. M. (2021). Love and breakup letter methodology: A new research technique for medical education. Medical Education, 55(7), 818–824. https://doi.org/10.1111/medu.14463\n",
   "Tags": "workshop;letters;feelings"
 },
 {
   "Name": "Design Fiction",
   "Number": 38,
   "Grade": 5,
   "Input": "Designer writes a fictional story about realistic yet hypothetical objects.",
   "Output": "Imaginary narratives and contexts regarding a hypothetical object.",
   "What it does": "Provides the designer with imaginary portrayals of an object that he can use to explore the potential advantages and disadvantages of the object.",
   "How it works": "The Design Fiction method is one that pushes the designer’s imagination. Contrary to traditional prototyping where existing functionality is investigated, an imaginary scenario is created and its surrounding world is explored. This method is usually applied in phases two or three. Design fiction has been described as a narrower genre of speculative design where the “fiction” refers to science fiction due to the technological roots of design fiction and as such the focus is on what kind of technology the future may hold. Design fictions are usually more celebrative of technological advancements rather than challenging them or questioning (Dunne & Raby, p. 100). Design Fiction is a world-building exercise that speculates about the technological future, where the designer creates a future world, explores what kind of technology this world has and ponders the implications certain technology can have on that world. This provides the designer with a tool to evaluate the outcomes and repercussions of a design, e.g. what the social or ethical consequences of a certain design are. But what happens if the design product has bad consequences or even causes harm to the fictional users? The designer is free to generate any story he wants, so he can also choose what story he does not want to tell and thus which outcomes he does not want to see which gives him a chance to evaluate if the world would benefit from his design or not. That is exactly the point of design fiction, to inspire reflection (Hanington & Martin, 2019, p. 82).",
   "Experience": "My experience with this method is that it can be helpful in extending the imaginative boundaries of the designer in order to come up with new ideas. In my experience it is easier and perhaps more fun to come up with a negative scenario which causes the design product to turn into some kind of satire which is not the main reason for using design fiction. It should aid reflection but that reflection doesn’t have to be on a negative note. However, as a reflective method it can be very helpful to place your existing product or idea of a product into a fictional world to “see” how the product will fare, what could happen to it and what could happen because of it.",
   "References": "Dunne, A., & Raby, F. (2013). Speculative Everything : Design, Fiction, and Social Dreaming. MIT Press.\nHanington, B., & Martin, B. (2019). Universal methods of design expanded and revised. Quarto Publishing Group USA.",
   "Tags": "design fiction;speculative;fictional;imaginary;ideation"
 },
 {
   "Name": "Personas",
   "Number": 82,
   "Grade": 9,
   "Input": "Information about users, e.g. gathered from interviews, questionnaires or other user research methods.",
   "Output": "A persona described through text and visual illustration/s that explain her characteristics, backstory, behavior and needs etc.",
   "What it does": "The design team uses gathered information to create a persona to aid the process of understanding the users.",
   "How it works": "The method of creating personas revolves around understanding the people who are the users of the product. To help the designers understand and relate to these users, creating personas is one option. In order to craft personas, the designers must gather data about their users and look for the behavioral patterns that define them. Similar attributes can then be clustered together into an affinity diagram, i.e. grouping similar items together, which can help construct the different personas. A typical persona will have a name, image, backstory that describes their life, goals and behaviours and is usually described in one page or less (Hanington & Martin, 2019, p. 170).\n        Personas can also be crafted for different purposes, depending on what style best suits the project. Four such types of personas are goal-directed personas, role-based personas, engaging personas and fictional personas. Goal-directed personas can be used to investigate the user’s process and workflow when trying to reach whatever goal their interaction with the product has. Role-based personas are also goal-directed but focus on the user’s behaviour and are based on qualitative and quantitative data gathered about users. Engaging personas can be both goal-directed and role-based and their purpose is to allow designers to engage with them and see them as real users in order to examine the user’s emotions, psychology, backgrounds and relevance. Finally, fictional personas emerge from the assumptions of the design team based on their previous experience and interaction with users in order to envision what a typical user looks like  (Dam & Siang, 2020).\n",
   "Experience": "My experience with this method is that it works well when defining and detailing the user group. The method helps the designers see the users as real people by gathering what is known about them and creating different personas that the designers get to know in the process. While it can be a fun activity, it can also take some time if the goal is to create multiple personas with many details, so it might be better to limit the number of personas and do them well instead of trying to produce many of them. It is also important that the personas remain realistic and don’t become caricatures of the real users.",
   "References": "Dam, R. F., & Siang, T. Y. (2020, December 23). Personas - A Simple Introduction. The \nInteraction Design Foundation.\nhttps://www.interaction-design.org/literature/article/personas-why-and-how-you-should-use-them\nHanington, B., & Martin, B. (2019). Universal methods of design expanded and revised. Quarto Publishing Group USA.",
   "Tags": "personas;story;users;characters;illustrations"
 },
 {
   "Name": "Scenarios",
   "Number": 92,
   "Grade": 9,
   "Input": "Information about the users and their experience with a product.",
   "Output": "A descriptive story that chronicles the experience of a user’s interaction with the product. ",
   "What it does": "The design team creates a story about how a user might interact with the product, what his goals are and what hardships he might face in the process.",
   "How it works": "A scenario is a description of a situation in which a user engages with the product. It is seen from the user’s perspective, and is usually set in the future. A scenario’s purpose is to make the design ideas tangible in order to help the designers come up with future use cases and ways to interact with the product. Each scenario is written in the form of a story and focuses on what the product can help the user do and what he can do with the product (Hanington & Martin, 2019, p. 190).\n        Scenarios are a great way to describe and visualize archetypal activities of the user and can be used both early and continuously in the design process. The benefit of using them early is that they provide use cases even before the situations in which they are used are created. The elements of a scenario include a setting, actors, actions, events, objectives and goals (Carroll, 2000).\n        Scenarios are not only for exploring future interactions, but can also be used to analyse current user behaviour in order to identify any limitations or dislikes that people might experience when using the product. Scenarios aid with the exploration of user needs and requirements as well as discussion of context. Although it can, it doesn’t need to explain how the technology works and it is usually phrased in plain words, that is in a way that is easily communicated to the stakeholders. Stakeholders should be able to relate easily to the story-based scenarios to understand the user’s goals for the product (Sharp et al., 2019).\n",
   "Experience": "My experience with scenarios is that they help the designers understand the steps a user might take when using a product. Users may have different reasons for using the products and they may encounter different problems with it, for example I take the bus because I don’t have a car in Sweden but Greta Thunberg will take the bus to be environmentally friendly. I will also prefer the bus when in Sweden but in my home country I will prefer driving myself. An old person might prefer using a physical bus card while an international student prefers using the app, but the student runs into problems when purchasing a student ticket because he doesn’t have a personnummer. These are just small examples but they show how different users will have different needs and the designers will have to understand the different ways users interact with their products.",
   "References": "Carroll, J. (2000). Five reasons for scenario-based design. Interacting with Computers, 13(1), 43–60. https://doi.org/10.1016/s0953-5438(00)00023-0\nHanington, B., & Martin, B. (2019). Universal methods of design expanded and revised. Quarto Publishing Group USA.\nSharp, H., Preece, J., & Rogers, Y. (2019). Interaction Design: Beyond Human-Computer Interaction (5th ed.). Wiley.",
   "Tags": "personas;story;users;characters;illustrations"
 },
 {
   "Name": "Affinity Diagramming",
   "Number": 3,
   "Grade": 6,
   "Input": "Ideas, observations, research findings.",
   "Output": "Purposefully clustered ideas which aid in identifying recurring themes in the research.",
   "What it does": "Organizes ideas or findings into clustered structures.",
   "How it works": "Affinity diagramming is a method used to group together related artifacts. It can be used for different purposes, for example to organize research observations or ideas that can emerge during the design process. The notes are written down on post-it notes that are easy to move around on a board. The first step is to generate the notes by having team members write their findings or ideas down on post-it notes, and the second step is to group post-its that belong together. After sorting the post-its into categories, each post-it should be prioritized within its category (Pernice, 2018).\n        The method can be modified depending on the context it is being used in. When using affinity diagramming for observing and interviewing users, an average of 50-100 observations would be beneficial for each interviewed person. Then each observation gets its own sticky note which is placed on the board for further analysis and clustering. When using affinity diagramming for usability tests, a color can be assigned to each participant so that it is easy to see which notes came from the same user. The team observes the user during the usability test and simultaneously records their observations by writing them on the post-its and placing the on the board. After clustering similar experiences together, the different colored post-its show how many people had the same issues during the usability test (Hanington & Martin, 2019, pp. 12-13).\n",
   "Experience": "My experience with affinity diagramming is that it is especially good when combined with another method and used to sort that other method. It can for example be used to sort brainstorming ideas and it is very similar to the creative matrix method except the creative matrix method uses predefined categories with a horizontal and vertical axis while in the affinity diagramming method the groups are created after the post-it generation.",
   "References": "Hanington, B., & Martin, B. (2019). Universal methods of design expanded and revised. Quarto Publishing Group USA.\nPernice, K. (2018, February 18). Affinity Diagramming: Collaboratively Sort UX Findings & Design Ideas. Nielsen Norman Group. https://www.nngroup.com/articles/affinity-diagram/\n",
   "Tags": "grouping;visualizing;ideation"
 },
 {
   "Name": "Creative Matrix",
   "Number": 27,
   "Grade": 8,
   "Input": "Problem statements, topics, ideas.",
   "Output": "Ideas that are grouped together into the problem and topic they are intended to solve.",
   "What it does": "Many ideas are generated based on statements/questions and solution-enabling categories.",
   "How it works": "The creative matrix method is all about coming up with innovative ideas. Participants, ideally about in teams of four to six in total, are armed with post-it notes and pens which they use to write ideas and place them on a board. The board is large, and contains several rows and columns. The columns are marked with problem statements related to people and can be in the form of “How might we...” questions, while the rows are solution-enabling categories/topics such as spaces, technologies or activities (Hanington & Martin, 2019, p. 60).\n        This method gives the participants freedom to share all their ideas, no matter how simple or creative they are. By having the rows and columns set up, they encourage the participants to come up with ideas that intersect the topics of people and solutions. Divergent thinking is promoted and participants can come up with fresh and unusual ideas in a relatively short time since no more than 15-20 minutes are usually spent on this method (LUMA Institute, 2021).\n",
   "Experience": "My experience with the creative matrix is that it is very good for coming up with new ideas and thinking both inside and outside the box at the same time. As described by Hanington & Martin (2019), it is very helpful to combine the method with “How might we…” questions to guide the participants into certain directions while not restricting their creativity. The questions help the participants come up with solutions to the existing problems that the design team has already identified. This way, all participants get the same basic understanding of what needs to be solved yet by coming up with ideas individually they can apply their own knowledge, wants and understanding to the ideas.",
   "References": "Hanington, B., & Martin, B. (2019). Universal methods of design expanded and revised. Quarto Publishing Group USA.\nLUMA Institute. (2021, July 22). Creative Matrix. https://www.luma-institute.com/creative-matrix/\n",
   "Tags": "grouping;visualizing;ideation"
 },
 {
   "Name": "Prototyping",
   "Number": 85,
   "Grade": 10,
   "Input": "Ideas are made visual through drawings.",
   "Output": "Testable artifacts of the design.",
   "What it does": "What it does\nPhysical artifacts of the design are created through low- or high-fidelity prototyping.\n",
   "How it works": "Prototyping is to create physical artifacts of the design. A prototype doesn’t have to be physical in the word’s literal meaning, it can also be digital for example in the case of user interfaces in apps or websites. They are defined by how advanced they are, which is called the fidelity level. A low-fidelity prototype is often used in the early phases of design in order to support ideation. Low-fidelity means that the prototype is simplistic, for example paper prototypes that can be used as computer screens in a usability test. A low-fidelity prototype can also be a sketch of a physical object used to explain the design or as models in iterative design review. A high-fidelity prototype however is better refined than the low-fidelity one, and often looks as close to the final product as possible (Hanington & Martin, 2019, p. 176).\n        Prototypes are especially useful since they are much easier to test than the finished product. Writing code for example is much more time consuming and therefore more expensive than creating a paper prototype. Prototypes are an important part of testing and verification and as such it is worthwhile to evaluate what the level of fidelity should be. While low-fidelity ones can provide results quickly and cheaply, they are more useful at the early stages of design while the designers might opt for a higher level of fidelity during the later phases. Some benefits of higher-fidelity prototypes when compared to lower-fidelity prototypes is that higher-fidelity ones provide a quicker response from users since they for example usually don’t require a test facilitator to change the webpage meaning there are minimal pauses between the user’s actions, more specific elements can be tested such as the workflow and UI components, and the designer doesn’t have to facilitate the test as much and can put more focus on observing the user (Pernice, 2016).\n",
   "Experience": "My experience with prototyping is that it is an inseparable part of design, every design process I’ve participated in has included some type of prototyping in order to visualize the product or idea. By testing an early prototype you get feedback early in the process so you have time to change or alter the design and not spend time on designing things that the users don’t like or are unnecessary. ",
   "References": "Hanington, B., & Martin, B. (2019). Universal methods of design expanded and revised. Quarto Publishing Group USA.\nPernice, K. (2016, December 18). UX Prototypes: Low Fidelity vs. High Fidelity. Nielsen Norman Group. https://www.nngroup.com/articles/ux-prototype-hi-lo-fidelity/\n",
   "Tags": "visualizing;illustrations"
 }
]